wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_fmc.h
/*!
    \file    gd32g5x3_fmc.h
    \brief   definitions for the FMC

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_FMC_H
#define GD32G5X3_FMC_H

#include "gd32g5x3.h"

/* FMC and option bytes definition */
#define FMC                                    FMC_BASE                                         /*!< FMC base address */

/* registers definitions */
#define FMC_WS                                 REG32(FMC + 0x00000000U)                         /*!< FMC wait state register */
#define FMC_RUNKEY                             REG32(FMC + 0x00000004U)                         /*!< FMC unlock flash mode during run mode key register */
#define FMC_KEY                                REG32(FMC + 0x00000008U)                         /*!< FMC unlock key register */
#define FMC_OBKEY                              REG32(FMC + 0x0000000CU)                         /*!< FMC option bytes unlock key register */
#define FMC_STAT                               REG32(FMC + 0x00000010U)                         /*!< FMC status register */
#define FMC_CTL                                REG32(FMC + 0x00000014U)                         /*!< FMC control register */
#define FMC_ECCCS                              REG32(FMC + 0x00000018U)                         /*!< FMC ECC control and status register */
#define FMC_OBCTL                              REG32(FMC + 0x00000020U)                         /*!< FMC FMC option byte control register */
#define FMC_DCRP_SADDR0                        REG32(FMC + 0x00000024U)                         /*!< FMC DCRP area start address register 0 */
#define FMC_DCRP_EADDR0                        REG32(FMC + 0x00000028U)                         /*!< FMC DCRP area end address register 0 */
#define FMC_BK0WP0                             REG32(FMC + 0x0000002CU)                         /*!< FMC bank0 erase/program protection area 0 register */
#define FMC_BK0WP1                             REG32(FMC + 0x00000030U)                         /*!< FMC bank0 erase/program protection area 1 register */
#define FMC_DCRP_SADDR1                        REG32(FMC + 0x00000044U)                         /*!< FMC DCRP area start address register 1 */
#define FMC_DCRP_EADDR1                        REG32(FMC + 0x00000048U)                         /*!< FMC DCRP area end address register 1 */
#define FMC_BK1WP0                             REG32(FMC + 0x0000004CU)                         /*!< FMC bank1 erase/program protection area 0 register */
#define FMC_BK1WP1                             REG32(FMC + 0x00000050U)                         /*!< FMC bank1 erase/program protection area 1 register */
#define FMC_BK0SCR                             REG32(FMC + 0x00000070U)                         /*!< FMC bank0 securable area register */
#define FMC_BK1SCR                             REG32(FMC + 0x00000074U)                         /*!< FMC bank1 securable area register */
#define FMC_PID                                REG32(FMC + 0x00000100U)                         /*!< FMC product ID register */

/* bits definitions */
/* FMC_WS */
#define FMC_WS_WSCNT                           BITS(0,3)                                        /*!< wait state counter */
#define FMC_WS_PFEN                            BIT(8)                                           /*!< pre-fetch enable */
#define FMC_WS_ICEN                            BIT(9)                                           /*!< IBUS cache enable */
#define FMC_WS_DCEN                            BIT(10)                                          /*!< DBUS cache enable */
#define FMC_WS_ICRST                           BIT(11)                                          /*!< IBUS cache reset */
#define FMC_WS_DCRST                           BIT(12)                                          /*!< DBUS cache reset */
#define FMC_WS_RUN_MDSEL                       BIT(13)                                          /*!< flash power-down mode during run mode */
#define FMC_WS_SLP_MDSEL                       BIT(14)                                          /*!< flash power-down mode during sleep mode */
#define FMC_WS_DBGEN                           BIT(18)                                          /*!< enable/disable the debugger by software */

/* FMC_RUNKEY */
#define FMC_RUNKEY_RUN_KEY                     BITS(0,31)                                       /*!< FMC_WS_RUN_MDSEL unlock key */

/* FMC_KEY */
#define FMC_KEY_KEY                            BITS(0,31)                                       /*!< FMC_CTL unlock key */

