wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_fmc.h
/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY                        BITS(0,31)                                       /*!< option bytes unlock key */

/* FMC_STAT */
#define FMC_STAT_ENDF                          BIT(0)                                           /*!< end of operation flag */
#define FMC_STAT_OPRERR                        BIT(1)                                           /*!< operation error flag bit */
#define FMC_STAT_PGERR                         BIT(3)                                           /*!< flash program error flag */
#define FMC_STAT_WPERR                         BIT(4)                                           /*!< erase/program protection error flag */
#define FMC_STAT_PGAERR                        BIT(5)                                           /*!< flash program alignment error flag */
#define FMC_STAT_PGMERR                        BIT(6)                                           /*!< program size error flag bit */
#define FMC_STAT_PGSERR                        BIT(7)                                           /*!< program sequence error flag bit */
#define FMC_STAT_RPERR                         BIT(14)                                          /*!< read protection error flag bit */
#define FMC_STAT_OBERR                         BIT(15)                                          /*!< option byte read error */
#define FMC_STAT_BUSY                          BIT(16)                                          /*!< flash busy flag */

/* FMC_CTL */
#define FMC_CTL_PG                             BIT(0)                                           /*!< main flash page program command bit */
#define FMC_CTL_PER                            BIT(1)                                           /*!< main flash page erase command bit */
#define FMC_CTL_MER0                           BIT(2)                                           /*!< main flash mass erase for bank0 command bit */
#define FMC_CTL_PNSEL                          BITS(3,10)                                       /*!< page number to erase */
#define FMC_CTL_BKSEL                          BIT(12)                                          /*!< bank number selection for page erase */
#define FMC_CTL_MER1                           BIT(15)                                          /*!< main flash mass erase for bank1 command bit */
#define FMC_CTL_START                          BIT(16)                                          /*!< send erase command to FMC bit */
#define FMC_CTL_OBSTART                        BIT(17)                                          /*!< send option byte change command to FMC bit */
#define FMC_CTL_ENDIE                          BIT(24)                                          /*!< end of operation interrupt enable bit */
#define FMC_CTL_ERRIE                          BIT(25)                                          /*!< operation error interrupt enable bit */
#define FMC_CTL_RPERRIE                        BIT(26)                                          /*!< read protection error interrupt enable */
#define FMC_CTL_OBRLD                          BIT(27)                                          /*!< option byte reload bit */
#define FMC_CTL_SCR0                           BIT(28)                                          /*!< bank0 security access protection bit */
#define FMC_CTL_SCR1                           BIT(29)                                          /*!< bank1 security access protection bit */
#define FMC_CTL_OBLK                           BIT(30)                                          /*!< OB lock bit */
#define FMC_CTL_LK                             BIT(31)                                          /*!< FMC_CTL lock bit */

/* FMC_ECCCS */
#define FMC_ECCCS_ECCADDR                      BITS(0,18)                                       /*!< ECC fail address */
#define FMC_ECCCS_BK_ECC                       BIT(21)                                          /*!< ECC fail bank */
#define FMC_ECCCS_SYS_ECC                      BIT(22)                                          /*!< ECC error correction or double ECC error in system memory */
#define FMC_ECCCS_ECCCORIE                     BIT(24)                                          /*!< one-bit error correction interrupt enable */
#define FMC_ECCCS_ECCCOR1                      BIT(28)                                          /*!< one-bit error correction in 64bit MSB */ 
#define FMC_ECCCS_ECCDET1                      BIT(29)                                          /*!< two-bits error in 64bit MSB */
#define FMC_ECCCS_ECCCOR0                      BIT(30)                                          /*!< one-bit error correction flag(in 64bit MSB when DBS is 0) */
#define FMC_ECCCS_ECCDET0                      BIT(31)                                          /*!< two-bits error detected flag(in 64bit MSB when DBS is 0) */

/* FMC_OBCTL */
#define FMC_OBCTL_SPC                          BITS(0,7)                                        /*!< security protection value */
#define FMC_OBCTL_BOR_TH                       BITS(8,9)                                        /*!< BOR threshold status bits */
#define FMC_OBCTL_NRST_DPSLP                   BIT(12)                                          /*!< option byte deepsleep reset value bit */
#define FMC_OBCTL_NRST_STDBY                   BIT(13)                                          /*!< option byte standby reset value bit */
#define FMC_OBCTL_FMC_SWP                      BIT(15)                                          /*!< FMC memory mapping swap bit */
#define FMC_OBCTL_NFWDG_HW                     BIT(16)                                          /*!< free watchdog configuration bit */
#define FMC_OBCTL_FWDGSPD_DPSLP                BIT(17)                                          /*!< FWDGT suspend option in deepsleep mode configuration bit */
#define FMC_OBCTL_FWDGSPD_STDBY                BIT(18)                                          /*!< FWDGT suspend option in standby mode configuration bit */
#define FMC_OBCTL_BB                           BIT(20)                                          /*!< dual-bank boot bit */
#define FMC_OBCTL_DBS                          BIT(22)                                          /*!< bank mode bit */
#define FMC_OBCTL_NBOOT1                       BIT(23)                                          /*!< NBOOT1 option bit */
#define FMC_OBCTL_SRAM_ECCEN                   BIT(24)                                          /*!< SRAM and TCM SRAM ECC disable bit */
#define FMC_OBCTL_TCMSRAM_ERS                  BIT(25)                                          /*!< TCM SRAM erase while system reset bit */
#define FMC_OBCTL_NSWBT0                       BIT(26)                                          /*!< software BOOT0 bit */
#define FMC_OBCTL_NBOOT0                       BIT(27)                                          /*!< NBOOT0 option bit */
#define FMC_OBCTL_NRST_MDSEL                   BITS(28,29)                                      /*!< reset pin mode bit */

/* FMC_DCRP_SADDR0 */
#define FMC_DCRP_SADDR0_DCRP0_SADDR            BITS(0,14)                                       /*!< start address of DCRP area 0 */

/* FMC_DCRP_END_ADDR0 */
#define FMC_DCRP_EADDR0_DCRP0_EADDR            BITS(0,14)                                       /*!< end address of DCRP area 0 */
#define FMC_DCRP_EADDR0_DCRP0_EREN             BIT(31)                                          /*!< DCRP area 0 erase enable configuration bit */

/* FMC_BK0WP0 */
#define FMC_BK0WP0_BK0WP0_SADDR                BITS(0,7)                                        /*!< bank0 write protection area 0 start offset */
#define FMC_BK0WP0_BK0WP0_EADDR                BITS(16,23)                                      /*!< bank0 write protection area 0 end offset */

