wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_fmc.h
/* FMC_BK0WP1 */
#define FMC_BK0WP1_BK0WP1_SADDR                BITS(0,7)                                        /*!< bank0 write protection area 1 start offset */
#define FMC_BK0WP1_BK0WP1_EADDR                BITS(16,23)                                      /*!< bank0 write protection area 1 end offset */

/* FMC_DCRP_SADDR1 */
#define FMC_DCRP_SADDR1_DCRP1_SADDR            BITS(0,14)                                       /*!< start address of DCRP area 1 */

/* FMC_DCRP_END_ADDR1 */
#define FMC_DCRP_EADDR1_DCRP1_EADDR            BITS(0,14)                                       /*!< end address of DCRP area 1 */

/* FMC_BK1WP0 */
#define FMC_BK1WP0_BK1WP0_SADDR                BITS(0,7)                                        /*!< bank1 write protection area 0 start offset */
#define FMC_BK1WP0_BK1WP0_EADDR                BITS(16,23)                                      /*!< bank1 write protection area 0 end offset */

/* FMC_BK1WP1 */
#define FMC_BK1WP1_BK1WP1_SADDR                BITS(0,7)                                        /*!< bank1 write protection area 1 start offset */
#define FMC_BK1WP1_BK1WP1_EADDR                BITS(16,23)                                      /*!< bank1 write protection area 1 end offset */

/* FMC_BK0SCR */
#define FMC_BK0SCR_SCR_PAGE_CNT0               BITS(0,8)                                        /*!< configure the number of pages in the bank0 securable area */
#define FMC_BK0SCR_BOOTLK                      BIT(16)                                          /*!< this bit is set to force boot from main flash area */

/* FMC_BK1SCR */
#define FMC_BK1SCR_SCR_PAGE_CNT1               BITS(0,8)                                        /*!< configure the number of pages in the bank1 securable area */

/* FMC_PID */
#define FMC_PID_PID                            BITS(0,31)                                       /*!< product ID */

/* FMC_CTL unlock key */
#define FMC_UNLOCK_KEY0                        ((uint32_t)0x45670123U)                          /*!< FMC_CTL unlock key 0 */
#define FMC_UNLOCK_KEY1                        ((uint32_t)0xCDEF89ABU)                          /*!< FMC_CTL unlock key 1 */

/* FMC_CTL_OBLK unlock key */
#define OB_UNLOCK_KEY0                         ((uint32_t)0x08192A3BU)                           /*!< FMC_CTL_OBLK unlock key 0 */
#define OB_UNLOCK_KEY1                         ((uint32_t)0x4C5D6E7FU)                           /*!< FMC_CTL_OBLK unlock key 1 */

/* RUN_MDSEL unlock key */
#define RUN_MDSEL_UNLOCK_KEY0                  ((uint32_t)0x04152637U)                          /*!< RUN_MDSEL unlock key 0 */
#define RUN_MDSEL_UNLOCK_KEY1                  ((uint32_t)0xFAFBFCFDU)                          /*!< RUN_MDSEL unlock key 1 */

/* FMC wait state added */
#define WS_WSCNT(regval)                       (BITS(0,3) & ((uint32_t)(regval)))
#define FMC_WAIT_STATE_0                       WS_WSCNT(0)                                      /*!< 0 wait state added */
#define FMC_WAIT_STATE_1                       WS_WSCNT(1)                                      /*!< 1 wait state added */
#define FMC_WAIT_STATE_2                       WS_WSCNT(2)                                      /*!< 2 wait state added */
#define FMC_WAIT_STATE_3                       WS_WSCNT(3)                                      /*!< 3 wait state added */
#define FMC_WAIT_STATE_4                       WS_WSCNT(4)                                      /*!< 4 wait state added */
#define FMC_WAIT_STATE_5                       WS_WSCNT(5)                                      /*!< 5 wait state added */
#define FMC_WAIT_STATE_6                       WS_WSCNT(6)                                      /*!< 6 wait state added */
#define FMC_WAIT_STATE_7                       WS_WSCNT(7)                                      /*!< 7 wait state added */
#define FMC_WAIT_STATE_8                       WS_WSCNT(8)                                      /*!< 8 wait state added */
#define FMC_WAIT_STATE_9                       WS_WSCNT(9)                                      /*!< 9 wait state added */
#define FMC_WAIT_STATE_10                      WS_WSCNT(10)                                     /*!< 10 wait state added */
#define FMC_WAIT_STATE_11                      WS_WSCNT(11)                                     /*!< 11 wait state added */
#define FMC_WAIT_STATE_12                      WS_WSCNT(12)                                     /*!< 12 wait state added */
#define FMC_WAIT_STATE_13                      WS_WSCNT(13)                                     /*!< 13 wait state added */
#define FMC_WAIT_STATE_14                      WS_WSCNT(14)                                     /*!< 14 wait state added */
#define FMC_WAIT_STATE_15                      WS_WSCNT(15)                                     /*!< 15 wait state added */
                     
/* option byte security protection configuration */
#define FMC_NSPC                              ((uint8_t)0xAAU)                                  /*!< no protection */
#define FMC_LSPC                              ((uint8_t)0xBBU)                                  /*!< protection level low */
#define FMC_HSPC                              ((uint8_t)0xCCU)                                  /*!< protection level high */

/* option byte BOR threshold value */
#define OBCTL_BOR_TH(regval)                  (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define OB_BOR_TH_VALUE0                      OBCTL_BOR_TH(0)                                   /*!< BOR threshold value 0 */
#define OB_BOR_TH_VALUE1                      OBCTL_BOR_TH(1)                                   /*!< BOR threshold value 1 */
#define OB_BOR_TH_VALUE2                      OBCTL_BOR_TH(2)                                   /*!< BOR threshold value 2 */
#define OB_BOR_TH_VALUE3                      OBCTL_BOR_TH(3)                                   /*!< BOR threshold value 3 */

/* option byte reset or not entering deep sleep mode */
#define OBCTL_NRST_DPSLP(regval)              (BIT(12) & ((uint32_t)(regval) << 12U))
#define OB_DEEPSLEEP_RST                      OBCTL_NRST_DPSLP(0)                               /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST                     OBCTL_NRST_DPSLP(1)                               /*!< no reset when entering deepsleep mode */

