wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_fmc.h
/* option byte reset or not entering standby mode */
#define OBCTL_NRST_STDBY(regval)              (BIT(13) & ((uint32_t)(regval) << 13U))
#define OB_STDBY_RST                          OBCTL_NRST_STDBY(0)                               /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                         OBCTL_NRST_STDBY(1)                               /*!< no reset when entering deepsleep mode */

/* option byte software/hardware free watchdog timer */
#define OBCTL_NFWDG_HW(regval)                (BIT(16) & ((uint32_t)(regval) << 16U))
#define OB_FWDGT_HW                           OBCTL_NFWDG_HW(0)                                 /*!< hardware free watchdog */
#define OB_FWDGT_SW                           OBCTL_NFWDG_HW(1)                                 /*!< software free watchdog */

/* option byte FWDG status in deep-sleep mode */
#define OBCTL_FWDGSPD_DPSLP(regval)           (BIT(17) & ((uint32_t)(regval) << 17U))
#define OB_DPSLP_FWDGT_SUSPEND                OBCTL_FWDGSPD_DPSLP(0)                            /*!< free watchdog is suspended in deep-sleep mode */
#define OB_DPSLP_FWDGT_RUN                    OBCTL_FWDGSPD_DPSLP(1)                            /*!< free watchdog is running in deep-sleep mode */

/* option byte FWDG status in standby mode */
#define OBCTL_FWDGSPD_STDBY(regval)           (BIT(18) & ((uint32_t)(regval) << 18U))
#define OB_STDBY_FWDGT_SUSPEND                OBCTL_FWDGSPD_STDBY(0)                            /*!< free watchdog is suspended in standby mode */
#define OB_STDBY_FWDGT_RUN                    OBCTL_FWDGSPD_STDBY(1)                            /*!< free watchdog is running in standby mode */

/* option byte boot bank value */
#define OBCTL_BB(regval)                      (BIT(20) & ((uint32_t)(regval) << 20U))
#define OB_BB_DISABLE                         OBCTL_BB(0)                                       /*!< boot from bank0 */
#define OB_BB_ENABLE                          OBCTL_BB(1)                                       /*!< boot from bank1 or bank0 if bank1 is void */

/* option byte double-bank/single-bank selection */
#define OBCTL_DBS(regval)                     (BIT(22) & ((uint32_t)(regval) << 22U))
#define OB_SINGLE_BANK_MODE                   OBCTL_DBS(0)                                      /*!< single-bank selection */
#define OB_DUAL_BANK_MODE                     OBCTL_DBS(1)                                      /*!< double-bank selection */

/* option byte boot1 configuration */
#define OBCTL_NBOOT1(regval)                  (BIT(23) & ((uint32_t)(regval) << 23U))
#define OB_NBOOT1_VALUE_0                     OBCTL_NBOOT1(0)                                   /*!< option byte BOOT1 is value 1 */
#define OB_NBOOT1_VALUE_1                     OBCTL_NBOOT1(1)                                   /*!< option byte BOOT1 is value 0 */

/* option byte boot0 configuration */
#define OBCTL_NBOOT0(regval)                  (BIT(27) & ((uint32_t)(regval) << 27U))
#define OB_NBOOT0_VALUE_0                     OBCTL_NBOOT0(0)                                   /*!< option byte BOOT0 is value 1 */
#define OB_NBOOT0_VALUE_1                     OBCTL_NBOOT0(1)                                   /*!< option byte BOOT0 is value 0 */

/* option byte SRAM and TCM SRAM ECC enable */
#define OBCTL_SRAM_ECCEN(regval)              (BIT(24) & ((uint32_t)(regval) << 24U))
#define OB_SRAM_ECC_ENABLE                    OBCTL_SRAM_ECCEN(0)                                /*!< SRAM and TCM SRAM ECC enable */
#define OB_SRAM_ECC_DISABLE                   OBCTL_SRAM_ECCEN(1)                                /*!< SRAM and TCM SRAM ECC disable */

/* option byte TCM SRAM erase when system reset */
#define OBCTL_TCMSRAM_ERS(regval)             (BIT(25) & ((uint32_t)(regval) << 25U))
#define OB_TCMSRAM_ERASE_ENABLE               OBCTL_TCMSRAM_ERS(0)                               /*!< TCM SRAM erased if a system reset occurs */
#define OB_TCMSRAM_ERASE_DISABLE              OBCTL_TCMSRAM_ERS(1)                               /*!< TCM SRAM is not erased if a system reset occurs */

/* option byte software boot0 */
#define OBCTL_NSWBT0(regval)                  (BIT(26) & ((uint32_t)(regval) << 26U))
#define OB_NSWBOOT0_FROM_OB_BOOT0             OBCTL_NSWBT0(0)                                   /*!< BOOT0 taken from the option bit NBOOT0 */
#define OB_NSWBOOT0_FROM_PIN                  OBCTL_NSWBT0(1)                                   /*!< BOOT0 taken from PB8/BOOT0 pin */

/* option byte reset pin mode */  
#define OBCTL_RST_MD(regval)                  (BITS(28,29) & ((uint32_t)(regval) << 28U))
#define OB_NRST_PIN_INPUT_MODE                OBCTL_RST_MD(1)                                   /*!< a low level on the NRST pin can reset system, internal reset can not drive NRST pin */
#define OB_NRST_PIN_NORMAL_GPIO               OBCTL_RST_MD(2)                                   /*!< NRST pin function as normal GPIO */
#define OB_NRST_PIN_INPUT_OUTPUT_MODE         OBCTL_RST_MD(3)                                   /*!< NRST pin configure as input/output mode */

/* option byte DCRP erase enable configuration */
#define OB_DCRP_EADDR_DCRP_EREN(regval)       (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_DCRP_AREA_ERASE_DISABLE            OB_DCRP_EADDR_DCRP_EREN(0)                        /*!< DCRP is not erased when a SPC value is decreased from value 1 to value 0 */
#define OB_DCRP_AREA_ERASE_ENABLE             OB_DCRP_EADDR_DCRP_EREN(1)                        /*!< DCRP is erased when a SPC value is decreased from value 1 to value 0 */

/* option byte boot lock */
#define OB_SCR0_BOOTLK(regval)                (BIT(16) & ((uint32_t)(regval) << 16U))
#define OB_BOOT_UNLOCK                        OB_SCR0_BOOTLK(0)                                 /*!< unlock boot */
#define OB_BOOT_LOCK_FROM_MAIN_FLASH          OB_SCR0_BOOTLK(1)                                 /*!< boot from main flash */

/* option byte bank mapping swap */
#define OB_BKMAP_SWAP(regval)                 (BIT(15) & ((uint32_t)(regval) << 15U))
#define OB_BANK_MAPPING_SWAP                  OB_BKMAP_SWAP(0)                                 /*!< bank mapping swap */
#define OB_BANK_MAPPING_NOT_SWAP              OB_BKMAP_SWAP(1)                                 /*!< bank mapping not swap */

/* FMC interrupt enable */
#define FMC_INT_ERR                           FMC_CTL_ERRIE                                     /*!< FMC error interrupt enable */
#define FMC_INT_END                           FMC_CTL_ENDIE                                     /*!< FMC end of operation interrupt enable */
#define FMC_INT_RPERR                         FMC_CTL_RPERRIE                                   /*!< read protection error interrupt enable */
#define FMC_INT_ECCCOR                        FMC_ECCCS_ECCCORIE                                /*!< one-bit error interrupt enable */

/* FMC flags */
#define FMC_FLAG_BUSY                         FMC_STAT_BUSY                                     /*!< FMC busy flag */
#define FMC_FLAG_ENDF                         FMC_STAT_ENDF                                     /*!< FMC end of operation flag */
#define FMC_FLAG_OBERR                        FMC_STAT_OBERR                                    /*!< option byte read error */
#define FMC_FLAG_RPERR                        FMC_STAT_RPERR                                    /*!< read protection error */
#define FMC_FLAG_PGSERR                       FMC_STAT_PGSERR                                   /*!< program sequence error */
#define FMC_FLAG_PGMERR                       FMC_STAT_PGMERR                                   /*!< program size error*/
#define FMC_FLAG_PGAERR                       FMC_STAT_PGAERR                                   /*!< program alignment error */
#define FMC_FLAG_WPERR                        FMC_STAT_WPERR                                    /*!< erase/program protection error */
#define FMC_FLAG_PGERR                        FMC_STAT_PGERR                                    /*!< program error */
#define FMC_FLAG_OPRERR                       FMC_STAT_OPRERR                                   /*!< operation error */
#define FMC_FLAG_ECCDET0                      FMC_ECCCS_ECCDET0                                 /*!< two-bits error(in 64bit LSB when DBS is 0) */
#define FMC_FLAG_ECCCOR0                      FMC_ECCCS_ECCCOR0                                 /*!< one-bit error(in 64bit LSB when DBS is 0) */
#define FMC_FLAG_ECCDET1                      FMC_ECCCS_ECCDET1                                 /*!< two-bits error in 64bit MSB */ 
#define FMC_FLAG_ECCCOR1                      FMC_ECCCS_ECCCOR1                                 /*!< one-bit error in 64bit MSB */

