wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_fmc.h
/* FMC interrupt flags */
#define FMC_INT_FLAG_RPERR                    FMC_STAT_RPERR                                    /*!< read protection error interrupt flag */
#define FMC_INT_FLAG_OPRERR                   FMC_STAT_OPRERR                                   /*!< operation error interrupt flag */
#define FMC_INT_FLAG_END                      FMC_STAT_ENDF                                     /*!< end of operation interrupt flag */
#define FMC_INT_FLAG_ECCCOR0                  FMC_ECCCS_ECCCOR0                                  /*!< one-bit error detected and corrected flag */
#define FMC_INT_FLAG_ECCCOR1                  FMC_ECCCS_ECCCOR1                                  /*!< one-bit error detected and corrected flag of 64bit MSB */

#define BKSCR_SCR_PAGE_CNT_OFFSET             (0U)                                              /*!< bit offset of SCR_PAGE_CNT0/SCR_PAGE_CNT1 in FMC_BK0SCR/FMC_BK1SCR */
#define DCRP_SADDR_DCRP_SADDR_OFFSET          (0U)                                              /*!< bit offset of DCRP0_SADDR/DCRP1_SADDR in FMC_DCRP_SADDR0/FMC_DCRP_SADDR1 */
#define DCRP_EADDR_DCRP_EADDR_OFFSET          (0U)                                              /*!< bit offset of DCRP0_EADDR/DCRP1_EADDR in FMC_DCRP_EADDR0/FMC_DCRP_EADDR1 */
#define DCRP_EADDR_DCRP_EREN_OFFSET           (31U)                                             /*!< bit offset of DCRP_EREN in FMC_DCRP0_EADDR */
#define BKWP_BKWP_SADDR_OFFSET                (0U)                                              /*!< bit offset of BK0WP0_SADDR/BK0WP1_SADDR/BK1WP0_SADDR/BK1WP1_SADDR in FMC_BK0WP0/FMC_BK0WP1/FMC_BK1WP0/FMC_BK1WP1 */
#define BKWP_BKWP_EADDR_OFFSET                (16U)                                             /*!< bit offset of BK0WP0_EADDR/BK0WP1_EADDR/BK1WP0_EADDR/BK1WP1_EADDR in FMC_BK0WP0/FMC_BK0WP1/FMC_BK1WP0/FMC_BK1WP1 */

#define MAIN_FLASH_BASE_ADDRESS               ((uint32_t)0x08000000U)                           /*!< main flash base address */
#define MAIN_FLASH_SIZE                       ((uint16_t)REG32(0x1FFFB3E0U))                    /*!< main flash size */
#define MAIN_FLASH_BANK_SIZE                  (MAIN_FLASH_SIZE >> 1)                            /*!< main flash bank size */
#define MAIN_FLASH_PAGE_SIZE_DBANK            ((uint32_t)0x00000400U)                           /*!< main flash page size for dual bank mode */
#define MAIN_FLASH_PAGE_SIZE_SBANK            ((uint32_t)0x00000800U)                           /*!< main flash page size for single bank mode */
#define FMC_TIMEOUT_COUNT                     ((uint32_t)0xFFFFFFFFU)                           /*!< count to judge FMC timeout */

#define INVLD_AREA_ADDRESS                    ((uint32_t)0x00000000U)                           /*!< the area address is invalid */
#define VLD_AREA_ADDRESS                      ((uint32_t)0x00000001U)                           /*!< the area address is valid */
#define INVLD_AREA_SIZE                       ((uint32_t)0x00000000U)                           /*!< the area size is invalid */
#define VLD_AREA_SIZE                         ((uint32_t)0x00000001U)                           /*!< the area size is valid */

/* DCRP area definition */
#define DCRP_AREA0                            ((uint32_t)0x00000000U)                           /*!< the DCRP area of bank0 when DBS=1 or the first area of whole memory when DBS=0 */
#define DCRP_AREA1                            ((uint32_t)0x00000001U)                           /*!< the DCRP area of bank1 when DBS=1 or the first area of whole memory when DBS=0 */
/* write protection area definition */
#define BK0WP_AREA0                           ((uint32_t)0x00000000U)                           /*!< the first area of bank0 when DBS=1 or the first area of whole memory when DBS=0 */
#define BK0WP_AREA1                           ((uint32_t)0x00000001U)                           /*!< the second area of bank0 when DBS=1 or the second area of whole memory when DBS=0 */
#define BK1WP_AREA0                           ((uint32_t)0x00000002U)                           /*!< the first area of bank1 when DBS=1 or the third area of whole memory when DBS=0 */
#define BK1WP_AREA1                           ((uint32_t)0x00000003U)                           /*!< the second area of bank1 when DBS=1 or the fourth area of whole memory when DBS=0 */
/* secure area definition */
#define SCR_AREA0                             ((uint32_t)0x00000000U)                           /*!< the secure area of bank0 */
#define SCR_AREA1                             ((uint32_t)0x00000001U)                           /*!< the secure area of bank1 */
/* bank definition */
#define FMC_BANK0                             ((uint32_t)0x00000000U)                           /*!< FMC bank0 */
#define FMC_BANK1                             ((uint32_t)0x00000001U)                           /*!< FMC bank1 */

/* constants definitions */
/* fmc state */
typedef enum
{
    FMC_READY = 0,                                                                              /*!< the operation has been completed */
    FMC_BUSY,                                                                                   /*!< the operation is in progress */
    FMC_OBERR,                                                                                  /*!< option byte read error */
    FMC_RPERR,                                                                                  /*!< read protection error */
    FMC_PGSERR,                                                                                 /*!< program sequence error */
    FMC_PGMERR,                                                                                 /*!< program size error*/
    FMC_PGAERR,                                                                                 /*!< program alignment error */
    FMC_WPERR,                                                                                  /*!< erase/program protection error */
    FMC_PGERR,                                                                                  /*!< program error */
    FMC_OPRERR,                                                                                 /*!< operation error */
    FMC_TOERR,                                                                                  /*!< timeout error */
    FMC_OB_HSPC,                                                                                /*!< high security protection */
    FMC_OB_LSPC,                                                                                /*!< low security protection */
}fmc_state_enum;

/* function declarations */
/* FMC main flash operation functions */
/* unlock the main FMC operation */
void fmc_unlock(void);
/* lock the main FMC operation */
void fmc_lock(void);
/* set the wait state */
void fmc_wscnt_set(uint32_t wscnt);
/* enable pre-fetch */
void fmc_prefetch_enable(void);
/* disable pre-fetch */
void fmc_prefetch_disable(void);
/* enable IBUS cache */
void fmc_icache_enable(void);
/* disable IBUS cache */
void fmc_icache_disable(void);
/* reset IBUS cache  */
void fmc_icache_reset(void);
/* enable DBUS cache */
void fmc_dcache_enable(void);
/* disable DBUS cache */
void fmc_dcache_disable(void);
/* reset DBUS cache */
void fmc_dcache_reset(void);
/* erase page */
fmc_state_enum fmc_page_erase(uint32_t bank, uint32_t page_number_in_bank);
/* erase bank0 */
fmc_state_enum fmc_bank0_erase(void);
/* erase bank1 */
fmc_state_enum fmc_bank1_erase(void);
/* erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* program a doubleword at the given address */
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data);
/* get base address of bank0 */
uint32_t fmc_bank0_base_address_get(void);
/* get base address of bank1 */
uint32_t fmc_bank1_base_address_get(void);
/* get page size */
uint32_t fmc_page_size_get(void);
/* enable debugger */
void fmc_debugger_enable(void);
/* disable debugger */
void fmc_debugger_disable(void);
/* flash enter power down mode when MCU enter sleep mode */
void fmc_slp_pd_mode_enable(void);
/* flash exit power down mode when MCU enter sleep mode  */
void fmc_slp_pd_mode_disable(void);
/* enable secure area protection */
void fmc_scr_area_enable(uint32_t scr_area);

/* FMC option bytes operation functions */
/* unlock the option bytes operation */
void ob_unlock(void);
/* lock the option bytes operation */
void ob_lock(void);
/* reload the option bytes operation */
void ob_reload(void);
/* program option bytes USER */
fmc_state_enum ob_user_write(uint32_t ob_user, uint32_t ob_user_mask);
/* configure the option byte security protection */
fmc_state_enum ob_security_protection_config(uint8_t ob_spc);
/* configure the option bytes DCRP area */
fmc_state_enum ob_dcrp_config(uint32_t dcrp_area, uint32_t dcrp_eren, uint32_t dcrp_start_addr, uint32_t dcrp_end_addr);
/* configure the option bytes write protection area */
fmc_state_enum ob_write_protection_config(uint32_t wp_area, uint32_t wp_start, uint32_t wp_end);
/* configure the option bytes secure area */
fmc_state_enum ob_scr_area_config(uint32_t scr_area, uint32_t secure_size);
/* configure the option byte boot lock */
fmc_state_enum ob_boot_lock_config(uint32_t boot_config);
/* configure FMC memory mapping swap bit */
fmc_state_enum ob_bank_memory_swap_config(uint32_t swp_config);
/* get the value of option bytes USER */
uint32_t ob_user_get(void);
/* get option byte BOR threshold value */
uint32_t ob_bor_threshold_get(void);
/* get the value of option bytes security protection level in FMC_OBCTL register */
uint8_t ob_security_protection_level_get(void);
/* get DCRP area configuration */
uint32_t ob_dcrp_area_get(uint32_t dcrp_area, uint32_t *dcrp_erase_option, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr);
/* get the value of option bytes write protection */
uint32_t ob_write_protection_get(uint32_t wp_area, uint32_t *wp_area_start_addr, uint32_t *wp_area_end_addr);
/* get size of secure area */
uint32_t ob_scr_area_size_get(uint32_t scr_area, uint32_t *scr_area_byte_cnt);
/* get boot configuration */
uint32_t ob_boot_config_get(void);
    
/* FMC interrupts and flags management functions */
/* get ECC flag status */
FlagStatus fmc_ecc_flag_get(uint32_t flag);
/* clear ECC flag status */
void fmc_ecc_flag_clear(uint32_t flag);
/* enable ECCCOR interrupt */
void fmc_ecccor_interrupt_enable(void);
/* disable ECCCOR interrupt */
void fmc_ecccor_interrupt_disable(void);
/* get ECCCOR interrupt flag */
FlagStatus fmc_ecccor_interrupt_flag_get(uint32_t flag);
/* clear ECCCOR interrupt flag */
void fmc_ecccor_interrupt_flag_clear(uint32_t flag);
/* get FMC flag status */
FlagStatus fmc_flag_get(uint32_t flag);
/* clear the FMC flag */
void fmc_flag_clear(uint32_t flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(uint32_t interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(uint32_t interrupt);
/* get FMC interrupt flag */
FlagStatus fmc_interrupt_flag_get(uint32_t flag);
/* clear FMC interrupt flag */
void fmc_interrupt_flag_clear(uint32_t flag);

#endif /* GD32G5X3_FMC_H */
